// *++
	//
// Copyright 2004, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution.  The full text of the license may be found at        
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   VfrStrings.vfr
// 
// Abstract:
// 
//   String definitions for Sample Setup formset.
// 
// Revision History:
// 
// --*/


/=#

#langdef eng "English"
#langdef fra "Francais"


#string STR_FORM_SET_TITLE             #language eng  "  Browser Testcase Engine"
                                       #language fra  "  Browser Testcase Engine"
#string STR_FORM_SET_TITLE_HELP        #language eng  "This is a sample driver which is used to test the browser op-code operations.  This is for development purposes and not to be distributed in any form other than a test application.  Here is a set of wide \wideAAAAAAAAA\narrow and narrow AAA!"
                                       #language fra  "This is a sample driver which is used to test the browser op-code operations.  This is for development purposes and not to be distributed in any form other than a test application.  Here is a set of wide \wideAAAAAAAAA\narrow and narrow AAA!"
#string STR_FORM1_TITLE                #language eng  "My First Setup Page"
                                       #language fra  "Mi Primero Arreglo Página"
#string STR_FORM2_TITLE                #language eng  "My Second Setup Page"
                                       #language fra  "Mi Segunda Paginación De la Disposición"
#string STR_FORM3_TITLE                #language eng  "My Third Setup Page"
                                       #language fra  "Mi Tercera Paginación De la Disposición"
#string STR_DYNAMIC_TITLE              #language eng  "My Dynamic Page"
                                       #language fra  "My Dynamic Page Spanish"
#string STR_SUBTITLE_TEXT              #language eng  "My subtitle text"
                                       #language fra  "Mi texto del subtítulo"
#string STR_SUBTITLE_TEXT2             #language eng  " "
                                       #language fra  " "
#string STR_CPU_STRING                 #language eng  "My CPU Speed is "
                                       #language fra  "My CPU Speed is "
#string STR_CPU_STRING2                #language eng  " "
                                       #language fra  " "
#string STR_ONE_OF_PROMPT              #language eng  "My one-of prompt #1"
                                       #language fra  "Mi uno- de guía # 1"
#string STR_ONE_OF_HELP                #language eng  "My one-of help is going to be a long string to test out the efficiency of the ability of the I am tired of typing capabilities"
                                       #language fra  "Mi uno- de ayuda va a ser una cadena larga a probar fuera de la eficacia de la capacidad del yo es cansada de capacidades el pulsar."
#string STR_ONE_OF_TEXT1               #language eng  "My one-of text #1"
                                       #language fra  "Mi uno- del texto # 1"
#string STR_ONE_OF_TEXT2               #language eng  "My one-of text #2"
                                       #language fra  "Mi uno- del texto # 2"
#string STR_ONE_OF_TEXT3               #language eng  "My one-of text #3"
                                       #language fra  "Mi uno- del texto # 3"
#string STR_ONE_OF_TEXT4               #language eng  "Suppress the Checkbox"
                                       #language fra  "Mi uno- del texto # 4"
#string STR_ONE_OF_TEXT5               #language eng  "GrayOut the Checkbox"
                                       #language fra  "Mi uno- del texto # 5"
#string STR_ONE_OF_TEXT6               #language eng  "Enable Checkbox"
                                       #language fra  "Mi uno- del texto # 6"
#string STR_BOOT_ORDER1                #language eng  "SmallBootList"
                                       #language fra  "Mi uno- del texto # 7"
#string STR_BOOT_ORDER2                #language eng  "LargeBootList"
                                       #language fra  "Mi uno- del texto # 8"
#string STR_CHECK_BOX_PROMPT           #language eng  "Activate this check box"
                                       #language fra  "Active Las Armas Nucleares"
#string STR_CHECK_BOX_HELP             #language eng  "This is the help message for the activation of check boxes.  This is not to be confused with activating Czech boxes, since one can never tell what the ramifications are of activating foreign controlled boxes are."
                                       #language fra  "Éste es el mensaje de la ayuda para la activación del armamento nuclear. Cuál es exactamente resistente calcular fuera sobre de eso?"
#string STR_CHECK_DYNAMIC_PROMPT       #language eng  "Activate Dynamic check box"
                                       #language fra  "Activate Dynamico check box"
#string STR_CHECK_DYNAMIC_HELP         #language eng  "This is the help message for the activation of check boxes.  This is not to be confused with activating Czech boxes, since one can never tell what the ramifications are of activating foreign controlled boxes are."
                                       #language fra  "Spanish - This is the help message for the activation of check boxes.  This is not to be confused with activating Czech boxes, since one can never tell what the ramifications are of activating foreign controlled boxes are."
#string STR_NUMERIC_PROMPT             #language eng  "How old are you?"
                                       #language fra  "Cómo viejo es usted?"
#string STR_NUMERIC_PROMPT1            #language eng  "How tall are you?"
                                       #language fra  "Cómo viejo es usted?"
#string STR_NUMERIC_MANUAL_PROMPT      #language eng  "How old are you? (Manual)"
                                       #language fra  "Cómo viejo es usted? (Manual)"
#string STR_TALL_MANUAL_PROMPT         #language eng  "How tall are you? (Manual)"
                                       #language fra  "Cómo viejo es usted? (Manual)"
#string STR_NUMERIC_HELP0              #language eng  "This is the help for those who are too old to understand the question. Type how old you are in a numeric value.  The valid range in this case is from 0 to 240.  Let's see if you actually read this help and figure that out."
                                       #language fra  "Ésta es la ayuda para los que sean demasiado viejos entender la pregunta. Pulse cómo es viejo usted está en años."

#string STR_NUMERIC_HELP1              #language eng  "This is the help for those who are curious about body height. Type how tall you are in a numeric value.  The valid range in this case is from 0 to 300 .  Let's see if you actually read this help and figure that out."
                                       #language fra  "Ésta es la ayuda para los que sean demasiado viejos entender la pregunta. Pulse cómo es viejo usted está en años."

#string STR_NUMERIC_HELP2              #language eng  "This is the help for those who are too old to understand the question. Type how old you are in a numeric value.  The valid range in this case is from 0 to 243 in step of 3.  Let's see if you actually read this help and figure that out."
                                       #language fra  "Ésta es la ayuda para los que sean demasiado viejos entender la pregunta. Pulse cómo es viejo usted está en años."

#string STR_NUMERIC_HELP3              #language eng  "This is the help for those who are curious about body height. Type how tall you are in a numeric value.  The valid range in this case is from 0 to 190.  Let's see if you actually read this help and figure that out."
                                       #language fra  "Ésta es la ayuda para los que sean demasiado viejos entender la pregunta. Pulse cómo es viejo usted está en años."

#string STR_PASSWORD_PROMPT            #language eng  "Set the system password"
                                       #language fra  "Cuál es la palabra mágica?"
#string STR_PASSWORD_HELP              #language eng  "This is a system password which will likely be used by the BDS architecture in it's platform portion of the code.  There is a very simple encryption in this sample and the password will be stored in NVRAM in it's encrypted form."
                                       #language fra  "Esto es analgous a mí que le pregunta cuál es su palabra de paso."
#string STR_GOTO_FORM1                 #language eng  "Enter Page 1"
                                       #language fra  "Vaya a paginar 1"
#string STR_GOTO_FORM2                 #language eng  "Enter Page 2"
                                       #language fra  "Vaya a paginar 2"
#string STR_GOTO_FORM3                 #language eng  "Enter Page 3"
                                       #language fra  "Vaya a paginar 3"
#string STR_GOTO_DYNAMIC               #language eng  "Goto Dynamic Page +"
                                       #language fra  "Vaya a página dynamico"
#string STR_GOTO_DYNAMIC2              #language eng  "Goto Fresh Dynamic Page"
                                       #language fra  "Vaya a página fresca dynamico"
#string STR_ERROR_INCONSISTENT         #language eng  "This is my inconsistent error message"
                                       #language fra  "Éste es mi mensaje de error contrario."
#string STR_ERROR_POPUP                #language eng  "You typed in something bad!"
                                       #language fra  "Esto es un mensaje de error del popup."
#string STR_MY_STRING_PROMPT           #language eng  "This is my string prompt"
                                       #language fra  "This is my string prompt"
#string STR_MY_STRING_HELP             #language eng  "This is my string help"
                                       #language fra  "This is my string help"
#string STR_MY_STRING_PROMPT2          #language eng  "String - Interactive"
                                       #language fra  "String - interactive"
#string STR_MY_STRING_HELP2            #language eng  "This is my string help - Interactive"
                                       #language fra  "This is my string help - interactive"
#string STR_TEXT_TEXT_1                #language eng  "This is my 1st text string"
                                       #language fra  "This is my 1st text string"
#string STR_TEXT_TEXT_2                #language eng  "This is my 2nd text string that I am testing"
                                       #language fra  "This is my 2nd text string that I am testing"
#string STR_DATE_PROMPT                #language eng  "System Date"
                                       #language fra  "Fecha del sistema"
#string STR_DATE_MONTH_HELP            #language eng  "This is the help for the month field. Valid range is from 1 to 12. (Error checking will be done against month/day/year combinations that are not supported.)"
                                       #language fra  "Esto es la ayuda para el campo de mes. La distancia válida es de 1 a 12. (Verificar de error se hará contra vez mes/día/las combinaciones de año que no se sostienen.)"
#string STR_DATE_DAY_HELP              #language eng  "This is the help for the day field. Valid range is from 1 to 31. (Error checking will be done against month/day/year combinations that are not supported."
                                       #language fra  "Esto es la ayuda para el campo de día. La distancia válida es de 1 a 31. (Verificar de error se hará contra vez mes/día/las combinaciones de año que no se sostienen.)"
#string STR_DATE_YEAR_HELP             #language eng  "This is the help for the year field. Valid range is from 1998 to 2099. (Error checking will be done against month/day/year combinations that are not supported."
                                       #language fra  "Esto es la ayuda para el campo de año. La distancia válida es de 1998 a 2099. (Verificar de error se hará contra mes/día/las combinaciones de año que no se sostienen. "
#string STR_TIME_PROMPT                #language eng  "System Time"
                                       #language fra  "Tiempo del sistema"
#string STR_TIME_HOUR_HELP             #language eng  "This is the help for the hour field. Valid range is from 0 to 23."
                                       #language fra  "Esto es la ayuda para el campo de hora. La distancia válida es de 0 a 23."
#string STR_TIME_MINUTE_HELP           #language eng  "This is the help for the minute field. Valid range is from 0 to 59."
                                       #language fra  "Esto es la ayuda para el campo de minuto. La distancia válida es de 0 a 59."
#string STR_TIME_SECOND_HELP           #language eng  "This is the help for the second field. Valid range is from 0 to 59."
                                       #language fra  "Esto es la ayuda para el segundo campo. La distancia válida es de 0 a 59."
#string STR_RESTORE_DEFAULTS_PROMPT    #language eng  "This is my restore defaults prompt"
                                       #language fra  "This is my Spanish restore defaults prompt"
#string STR_RESTORE_DEFAULTS_HELP      #language eng  "This is my restore defaults help"
                                       #language fra  "Ésta es mi ayuda española de los defectos del restore"
#string STR_SAVE_DEFAULTS_PROMPT       #language eng  "This is my save defaults prompt"
                                       #language fra  "This is my Spanish save defaults prompt"
#string STR_SAVE_DEFAULTS_HELP         #language eng  "This is my save defaults help"
                                       #language fra  "This is my Spanish save defaults help"
#string STR_TEXT_HELP                  #language eng  "This is my text help"
                                       #language fra  "This is my Spanish text help"
#string STR_GOTO_HELP                  #language eng  "This is my goto help"
                                       #language fra  "This is my Spanish goto help"
#string STR_BANNER_TITLE               #language eng  "This is my English banner title"
                                       #language fra  "Éste es mi título español de la bandera"
#string STR_SUPPRESS_IF_TEXT1          #language eng  "This is my English suppress-if text1"
                                       #language fra  "This is my Spanish suppress-if text1"
#string STR_SUPPRESS_IF_TEXT2          #language eng  "This is my English suppress-if text2"
                                       #language fra  "This is my Spanish suppress-if text2"
#string STR_GRAYOUT_IF_TEXT1           #language eng  "This is my English grayout-if text1"
                                       #language fra  "This is my Spanish grayout-if text1"
#string STR_GRAYOUT_IF_TEXT2           #language eng  "This is my English grayout-if text2"
                                       #language fra  "This is my Spanish grayout-if text2"
#string STR_INVENTORY_HELP             #language eng  "This is my English inventory help string"
                                       #language fra  "This is my Spanish inventory help string"
#string STR_INVENTORY_TEXT1            #language eng  "This is my English inventory text1 string"
                                       #language fra  "This is my Spanish inventory text1 string"
#string STR_INVENTORY_TEXT2            #language eng  "This is my English inventory text2 string"
                                       #language fra  "This is my Spanish inventory text2 string"
#string STR_TEST_OPCODE                #language eng  "Pick 1"
                                       #language fra  "Pick 1"
#string STR_TEST_OPCODE2               #language eng  "Pick 2"
                                       #language fra  "Pick 2"
#string STR_EXIT_TEXT                  #language eng  "Exit now!"
                                       #language fra  "Salir ahora!"
#string STR_NULL_STRING                #language eng  ""
                                       #language fra  ""
#string STR_TEST_STRING                #language eng  "This is a test string"
                                       #language fra  "Esto es una secuencia de la prueba"
#string STR_GRAYOUT_TEST               #language eng  "Grayout VarEq test"
                                       #language fra  "Grayout VarEq test"
#string STR_SUPPRESS_TEST              #language eng  "Suppress VarEq test"
                                       #language fra  "Suppress VarEq test"
#string STR_CLEAR_TEST                 #language eng  "Clear VarEq test"
                                       #language fra  "Clear VarEq test"

// Boot Order
#string STR_BOOT_TITLE                 #language eng  "Boot"
#string STR_BOOT_OPTIONS               #language eng  "Boot Order"
#string STR_BOOT_OPTION1               #language eng  "IDE HDD"
#string STR_BOOT_OPTION2               #language eng  "ATAPI CD"
#string STR_BOOT_OPTION3               #language eng  "PXE"
#string STR_BOOT_OPTION4               #language eng  "USB"


